#gcd为求最大公约数的函数
#lcm为求最小公倍数的函数

def gcd(x, y):
    """求最大公约数"""
    """
      计算最大公约数

      :param x: 正整数
      :param y：正整数
      :return: 返回最大公约数
      """
    #        请在此处添加代码       #
    # *************begin************#
    c = x % y
    if c== 0:
        return y
    return gcd(y, c)
    # **************end*************#


def lcm(x, y):
    """求最小公倍数"""
    """
          计算最小公倍数

          :param x: 正整数
          :param y：正整数
          :return: 返回最小公倍数
          """
    #        请在此处添加代码       #
    # *************begin************#
    return x * y // gcd(x, y)
    # **************end*************#